# Version control
brew "gh"
brew "git-lfs"
brew "git-secret"

# Development tools
brew "mise"
brew "buf"
brew "cue"
brew "pnpm"

# Container & Kubernetes
brew "kind"
brew "kubernetes-cli"
brew "tektoncd-cli"
brew "kubectx"
brew "stern"
brew "k9s"

# Utilities
brew "defaultbrowser"
brew "jq"
brew "yq"
brew "bat"
brew "tree"
brew "wget"
brew "watch"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "gitleaks"
brew "hadolint"
brew "shellcheck"
brew "pre-commit"

# Development environment
brew "chezmoi"
brew "ghq"
brew "fzf"
brew "herdr"

# Security
brew "mkcert"

# AI tools
cask "claude"
cask "codex"
cask "codex-app"
cask "google-gemini"
cask "antigravity"

# Applications
cask "cmux"
cask "visual-studio-code"
cask "docker-desktop"
cask "slack"
cask "notion"
cask "zoom"
cask "google-chrome"
cask "figma"
cask "discord"
cask "spotify"
