# Version control
brew "gh"
brew "git-lfs"
brew "git-secret"

# Development tools
brew "anyenv"

# Container & Kubernetes
brew "kind"
brew "kubernetes-cli"

# Utilities
brew "jq"
brew "bat"
brew "tree"
brew "wget"
brew "watch"
brew "grep"
brew "gitleaks"
brew "hadolint"
brew "pre-commit"

# Development environment
brew "direnv"
brew "chezmoi"

# Security
brew "mkcert"

# Applications
cask "visual-studio-code"
cask "docker"
cask "slack"
cask "notion"
cask "zoom"
cask "google-chrome"
cask "figma"
cask "discord"
cask "spotify"

# VSCode extensions
# AI/Completion
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"

# Git
vscode "github.vscode-github-actions"
vscode "mhutchie.git-graph"

# Languages & Linters
vscode "golang.go"
vscode "charliermarsh.ruff"
vscode "ms-python.python"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.isort"
vscode "redhat.vscode-yaml"
vscode "timonwong.shellcheck"
vscode "foxundermoon.shell-format"
vscode "exiasr.hadolint"

# Docker & Containers
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"

# Terraform
vscode "4ops.terraform"

# Productivity
vscode "gruntfuggly.todo-tree"
vscode "christian-kohler.path-intellisense"
vscode "oderwat.indent-rainbow"
vscode "mosapride.zenkaku"

# Themes & Icons
vscode "github.github-vscode-theme"
vscode "pkief.material-icon-theme"
